app/views/chefs/new.html.erb

SELECT "restaurants".* FROM "restaurants"
---
                <%= f.select :lang, options_for_select([['Russian', 'ru'], ['English', 'en']]), :prompt => "#{t('choose_language')}", class: "browser-default" %>
                <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name, { prompt: "#{t('jobplace')}" }, class: "browser-default" %>