app/views/bills/index.html.erb

			    	<% @bills.each do |bill| %>
						<% customer = Customer.find(bill.customer_id) %>
						<% cashier = Cashier.find(bill.cashier_id) %>
						<% order = Order.find(bill.order_id) %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "cashiers".* FROM "cashiers" WHERE "cashiers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 22]]