app/views/bills/new.html.erb

SELECT "customers".* FROM "customers"
---
              <div class="field">
                <%= f.collection_select :customer_id, Customer.all, :id, :lastname, { prompt: "-Select guest-" }, class: "browser-default" %>