app/views/waiters/new.html.erb

SELECT "restaurants".* FROM "restaurants"
---
                <%= f.text_field :lastname,     :placeholder => "Your name and lastname" %> </br>
                <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name, { prompt: "-Select jobplace-" }, class: "browser-default" %>