app/views/orders/index.html.erb

			    	<% @orders.each do |order| %>
						<% customer = Customer.find(order.customer_id) %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]