app/views/orders/new.html.erb

        <%= form_for(@order) do |f| %>
            <% reservation = Reservation.find(session[:reservation_id]) %>
            <% table = Table.find(reservation.table_id) %>
            <% waiter = Waiter.find(table.waiter.id) %>
            <% restaurant = Restaurant.find(waiter.restaurant_id) %>
            <% @menu = Menu.all %>
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", 27]]
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "waiters".* FROM "waiters" WHERE "waiters"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "menus".* FROM "menus" WHERE (restaurant_id = 1)

                <h5><%= f.cuisine %></h5>
                <% current_cuisine = Item.where(menu_id: f.id, restaurant_id: restaurant.id) %>
---
SELECT "items".* FROM "items" WHERE "items"."menu_id" = $1 AND "items"."restaurant_id" = $2  [["menu_id", 1], ["restaurant_id", 1]]