app/views/reservations/index.html.erb

			    	<% @reservations.each do |reservation| %>
						<% customer = Customer.find(reservation.customer_id) %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]