app/views/reservations/new.html.erb

        <div class="input-field col s10">
          <%= f.select :customer_id, customer_select, :placeholder => "#{t('select_customer')}" %>
---
SELECT "customers".* FROM "customers"

        <%= link_to "#{t('not_you')}", root_path %>
        <% @table = Table.find(session[:table]) %>
        <% @hall  = Hall.find(@table.hall_id) %>
        <% @restaurant = Restaurant.find(@table.restaurant_id) %>
        <% @waiter = Waiter.find(@table.waiter_id) %>
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "halls".* FROM "halls" WHERE "halls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "waiters".* FROM "waiters" WHERE "waiters"."id" = $1 LIMIT 1  [["id", 1]]