app/views/review_books/index.html.erb

			    	<% @review_books.each do |review_book| %>
							<% restaurant = Restaurant.find(review_book.restaurant_id) %>
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 2]]