app/views/review_books/new.html.erb

SELECT "customers".* FROM "customers"
---
              <div class="field">
                <%= f.collection_select :customer_id, Customer.all, :id, :lastname, { prompt: "-Select customer-" }, class: "browser-default" %>