app/views/cashiers/new.html.erb

    <%= f.text_field :lastname,     :placeholder => "Your name and lastname" %> </br>
    <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name, { prompt: "-Select restaurant-" }, class: "browser-default" %>
---
SELECT "restaurants".* FROM "restaurants"