app/views/tables/new.html.erb


                <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name, { prompt: "-Select restaurant-" }, class: "browser-default" %>
                <%= f.collection_select :waiter_id, Waiter.all, :id, :lastname, { prompt: "-Select waiter-" }, class: "browser-default" %>
---
SELECT "restaurants".* FROM "restaurants"
SELECT "waiters".* FROM "waiters"