app/views/items/index.html.erb

SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
---
			    	<% @items.each do |item| %>
						<% menu = Menu.find(item.menu_id) %>
						<% restaurant = Restaurant.find(item.restaurant_id) %>