app/controllers/administrators_controller.rb

SELECT "administrators".* FROM "administrators"
---
  def index
    @administrators = Administrator.all

INSERT INTO "administrators" ("lastname", "tel", "jobplace", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["lastname", "Юрий Талько"], ["tel", "+1231232123"], ["jobplace", 3], ["created_at", "2015-11-28 11:32:07.294209"], ["updated_at", "2015-11-28 11:32:07.294209"]]
---
  def create
    @administrator = Administrator.new(administrator_params)
    if @administrator.save

SELECT  "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @administrator = Administrator.find(params[:id])