app/controllers/bills_controller.rb

  def index
    @bills = Bill.all
---
SELECT "bills".* FROM "bills"

  def create
    @bill = Bill.new(bill_params)
    @bill.save
---
INSERT INTO "bills" ("OPTIONS", "SUMMARY", "customer_id", "cashier_id", "CREATED", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @bill = Bill.find(params[:id])
    @guest = Customer.find(@bill.customer_id)
    @cashier = Cashier.find(@bill.cashier_id)
    @restaurant = Restaurant.find(@cashier.restaurant_id)
---
SELECT  "bills".* FROM "bills" WHERE "bills"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "cashiers".* FROM "cashiers" WHERE "cashiers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]