app/controllers/cashiers_controller.rb

  def create
    @cashier = Cashier.new(cashier_params)
    @cashier.save
---
INSERT INTO "cashiers" ("LASTNAME", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["LASTNAME", "Evgeniy Koshelenko"], ["restaurant_id", 3], ["created_at", "2015-11-28 12:38:22.086801"], ["updated_at", "2015-11-28 12:38:22.086801"]]

  def show
    @cashier = Cashier.find(params[:id])
    @restaurant = Restaurant.find(@cashier.restaurant_id)
---
SELECT  "cashiers".* FROM "cashiers" WHERE "cashiers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]