app/controllers/chefs_controller.rb

INSERT INTO "chefs" ("LASTNAME", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["LASTNAME", "Elya Korobova"], ["restaurant_id", 3], ["created_at", "2015-11-28 12:22:19.396495"], ["updated_at", "2015-11-28 12:22:19.396495"]]
---
  def create
    @chef = Chef.new(chef_params)
    @chef.save

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @chef = Chef.find(params[:id])
    @restaurant = Restaurant.find(@chef.restaurant_id)