app/controllers/customers_controller.rb

INSERT INTO "customers" ("LASTNAME", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["LASTNAME", "Roman Kaporin"], ["created_at", "2015-11-28 17:38:12.664019"], ["updated_at", "2015-11-28 17:38:12.664019"]]
---
  def create
    @customer = Customer.new(customer_params)
    @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "customers" SET "lastname" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["lastname", "Roman Kaporin changed"], ["updated_at", "2015-12-10 10:59:35.625417"], ["id", 1]]
---
  def update
    @customer = Customer.find(params[:id])

    if @customer.update_attributes(customer_params)