app/controllers/halls_controller.rb

  def create
    @hall = Hall.new(hall_params)
    @hall.save
---
INSERT INTO "halls" ("HALL_TYPE", "CAPACITY", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["HALL_TYPE", "South Hall - No smoking"], ["CAPACITY", 62], ["restaurant_id", 3], ["created_at", "2015-11-28 12:53:46.886668"], ["updated_at", "2015-11-28 12:53:46.886668"]]

  def show
    @hall = Hall.find(params[:id])
    session.delete(:hall)
    session[:hall] = @hall.id
    @restaurant = Restaurant.find(session[:restaurant])
    @tables = Table.where('hall_id = ?', params[:id])
---
SELECT  "halls".* FROM "halls" WHERE "halls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "tables".* FROM "tables" WHERE (hall_id = '1')