app/controllers/hostesses_controller.rb

  def create
    @hostess = Hostess.new(hostess_params)
    @hostess.save
---
INSERT INTO "hostesses" ("NAME", "restaurant_id", "hall_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["NAME", "My nigga"], ["restaurant_id", 3], ["hall_id", 1], ["created_at", "2015-11-28 16:01:06.268625"], ["updated_at", "2015-11-28 16:01:06.268625"]]

  def show
    @hostess =    Hostess.find(params[:id])
    @restaurant = Restaurant.find(@hostess.restaurant_id)
    @hall =       Hall.find(@hostess.hall_id)
---
SELECT  "hostesses".* FROM "hostesses" WHERE "hostesses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "halls".* FROM "halls" WHERE "halls"."id" = $1 LIMIT 1  [["id", 1]]