app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @item = Item.all