app/controllers/menus_controller.rb

  def destroy
    Menu.find(params[:id]).destroy
---
DELETE FROM "menus" WHERE "menus"."id" = $1  [["id", 6]]
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT 1  [["id", 6]]