app/controllers/orders_controller.rb

  def create
    @reservation = Reservation.find(session[:reservation_id])
    @table = Table.find(@reservation.table_id)
    @customer = Customer.find(@reservation.customer_id)
    @waiter = Waiter.find(@table.waiter.id)
    @restaurant = Restaurant.find(@waiter.restaurant_id)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", 27]]
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 17]]
SELECT  "waiters".* FROM "waiters" WHERE "waiters"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]

    @order.manager_id = @manager.first.id
    @order.chef_id = @chef.first.id

    @order.save
---
INSERT INTO "orders" ("restaurant_id", "customer_id", "waiter_id", "manager_id", "chef_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["restaurant_id", 1], ["customer_id", 17], ["waiter_id", 1], ["manager_id", 3], ["chef_id", 2], ["created_at", "2015-12-10 00:56:36.139890"], ["updated_at", "2015-12-10 00:56:36.139890"]]

  def show
    @order = Order.find(params[:id])
    @restaurant = Restaurant.find(@order.restaurant_id)
    @customer   = Customer.find(@order.customer_id)
    @waiter     = Waiter.find(@order.waiter_id)
    @manager    = Manager.find(@order.manager_id)
    @chef       = Chef.find(@order.chef_id)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 42]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 17]]
SELECT  "waiters".* FROM "waiters" WHERE "waiters"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT 1  [["id", 2]]