app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("reserv_time", "from", "customer_id", "table_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reserv_time", "2015-12-25 00:00:00.000000"], ["from", 17], ["customer_id", 21], ["table_id", 1], ["created_at", "2015-12-11 11:18:27.982404"], ["updated_at", "2015-12-11 11:18:27.982404"]]
---
  def create
    @reservation = Reservation.new(reservation_params)

    unless signed_in?
      @reservation.customer_id = session[:customer_id]
      @reservation.table_id = session[:table]
    end

    if @reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", 27]]
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "halls".* FROM "halls" WHERE "halls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 17]]
---
  def completereservation
    clean_useless_session
    @reservation = Reservation.find(session[:reservation_id])
    @table = Table.find(@reservation.table_id)
    @hall = Hall.find(@table.hall_id)
    @restaurant = Restaurant.find(@hall.restaurant_id)
    @customer = Customer.find(session[:customer_id])

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @reservation = Reservation.find(params[:id])
    @restaurant = Restaurant.find_by_sql(["
    SELECT RESTAURANTS.*
      FROM RESTAURANTS
      INNER JOIN TABLES
      ON RESTAURANTS.ID = TABLES.RESTAURANT_ID AND TABLES.id = (
        SELECT TABLES.id
          FROM TABLES
          INNER JOIN RESERVATIONS
          ON TABLES.ID = RESERVATIONS.TABLE_ID AND RESERVATIONS.ID = ?)
    ", @reservation.id])

    @guest = Customer.find(@reservation.customer_id)