app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "address", "tel", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Makkaroni"], ["address", "Tupoleva, 18"], ["tel", "+32100100"], ["created_at", "2015-11-28 11:02:35.094021"], ["updated_at", "2015-11-28 11:02:35.094021"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "halls".* FROM "halls" WHERE (restaurant_id = '1')
---
  def show
    @restaurant = Restaurant.find(params[:id])
    @halls = Hall.where('restaurant_id = ?', params[:id])

SELECT "restaurants".* FROM "restaurants"
---
  def restaurants
    @restaurants = Restaurant.all