app/controllers/review_books_controller.rb

SELECT "review_books".* FROM "review_books"
---
  def index
    @review_books = ReviewBook.all

INSERT INTO "review_books" ("REVIEW", "customer_id", "review_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["REVIEW", "SUPERSUPERSUPERGOOD"], ["customer_id", 1], ["review_type", "commendation"], ["created_at", "2015-11-28 21:53:23.893494"], ["updated_at", "2015-11-28 21:53:23.893494"]]
---
  def create
    @review_book = ReviewBook.new(review_book_params)
    @review_book.save

SELECT  "review_books".* FROM "review_books" WHERE "review_books"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @review_book = ReviewBook.find(params[:id])
    @customer = Customer.find(@review_book.customer_id)