app/controllers/sessions_controller.rb

SELECT  "administrators".* FROM "administrators" WHERE "administrators"."login" = $1 LIMIT 1  [["login", "admin@weblab.org"]]
---
  def create
    administrator = Administrator.find_by(login: params[:session][:login])