app/controllers/tables_controller.rb

INSERT INTO "tables" ("VISNUMBER", "restaurant_id", "waiter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["VISNUMBER", 16], ["restaurant_id", 3], ["waiter_id", 1], ["created_at", "2015-11-28 16:47:00.732763"], ["updated_at", "2015-11-28 16:47:00.732763"]]
---
  def create
    @table = Table.new(table_params)
    @table.save

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "waiters".* FROM "waiters" WHERE "waiters"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "halls".* FROM "halls" WHERE "halls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "hostesses".* FROM "hostesses" WHERE (hall_id = 1)
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "reservations".* FROM "reservations" WHERE (reserv_time = '2015-12-10' and table_id = 3)
---
  def show
    @table = Table.find(params[:id])
    @waiter = Waiter.find(@table.waiter_id)

    session.delete(:table)
    session[:table] = @table.id

    @hall = Hall.find(@table.hall_id)
    @hostess = Hostess.where('hall_id = ? and lang = ?', @hall.id, I18n.locale)
    @restaurant = Restaurant.find(@hall.restaurant_id)
    @today = Reservation.where('reserv_time = ? and table_id = ?', Date.today.to_s, @table.id)