app/controllers/waiters_controller.rb

INSERT INTO "waiters" ("LASTNAME", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["LASTNAME", "Evgeniy Evtushenko"], ["restaurant_id", 3], ["created_at", "2015-11-28 12:32:10.237795"], ["updated_at", "2015-11-28 12:32:10.237795"]]
---
  def create
    @waiter = Waiter.new(waiter_params)
    @waiter.save

SELECT  "waiters".* FROM "waiters" WHERE "waiters"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @waiter = Waiter.find(params[:id])
    @restaurant = Restaurant.find(@waiter.restaurant_id)