app/views/hostesses/new.html.erb

                <%= f.text_field :lastname,     :placeholder => "Your name and lastname" %></br>
                <%= f.collection_select :restaurant_id, Restaurant.all, :id, :name, { prompt: "-Select jobplace-" }, class: "browser-default" %>
                <%= f.collection_select :hall_id, Hall.all, :id, :hall_type, { prompt: "-Select your hall-" }, class: "browser-default" %>
---
SELECT "restaurants".* FROM "restaurants"
SELECT "halls".* FROM "halls"